IdeaRS.OpenModel.Detail.LongReinfEndType
End type of longitudional reinforcement

IdeaRS.OpenModel.Detail.LongReinfEndType.None
None

IdeaRS.OpenModel.Detail.LongReinfEndType.Bend
Bend

IdeaRS.OpenModel.Detail.LongReinfEndType.Hook
Hook

IdeaRS.OpenModel.Detail.LongReinfEndType.Loop
Loop

IdeaRS.OpenModel.Detail.LongReinfEndType.WeldedTransverseBar
WeldedTransverseBar

IdeaRS.OpenModel.Detail.LongReinfEndType.ContinuousBar
Continuous bar - full anchorage

IdeaRS.OpenModel.Detail.LongReinfEndType.ContinuousBarOutside
Continuous bar outside - no anchorage

IdeaRS.OpenModel.Detail.LongReinfEndType.Hook90DegreeACI
90 degree hook for ACI

IdeaRS.OpenModel.Detail.LongReinfEndType.Hook180DegreeACI
180 degree hook for ACI